Catalogs/ИА_ВидыСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВидыСтатистик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПеревернутаяСтатистика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтображаетСостояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтогов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтоговЗаОдинПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтоговЗаОдинПериод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПроизвольноеВыражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКуб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКуба</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_НомерКуба</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеПериод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеКоличество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ХранилищеЗапросаКонструктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЛинии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабПараметровЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаИтоговый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйСписок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПроверочныйСписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПоляРасшифровки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеРегистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатистикиФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ИА_ВариантыПолученияДанныхСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыПолученияДанныхСтатистик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументомСтатистика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ВидыИтоговЗаОдинПериод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВидыИтоговЗаОдинПериод</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднееЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоРазличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеВыражение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_ВидыСтатистик/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИспользоватьКуб1ПриИзменении(Элемент)
	Если Объект.ИспользоватьКуб Тогда
		ПроверитьВариантПолученияДанных();
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ПроверитьВариантПолученияДанных()
	Если Объект.ВариантПолученияДанных <> Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ИзЗапроса Тогда
		Сообщить("Кубы можно использовать только для статистик с получением данных из запроса.");
		Объект.ИспользоватьКуб = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьПроизвВыражение(Отказ)
	Если Объект.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.ПроизвольноеВыражение И Сокрлп(Объект.ИтогПроизвольноеВыражение)="" Тогда
		Сообщить("Укажите выражение для получения итогов за один период.");
		Отказ = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьПроизвВыражение(Отказ);
	
	Если Объект.ИспользоватьКуб и Объект.НомерКуба.Пустая() Тогда
		Сообщить("Укажите номер куба!");
		Отказ = истина;
	КонецЕсли;
	
	Если Объект.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.Конструктором") Тогда
		ОбработкаПроверкиЗаполнения(Отказ);
	КонецЕсли;	
	//СохранитьНастройки();

КонецПроцедуры

&НаКлиенте
Процедура ВариантПолученияДанныхПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	ИзЗапроса = (Объект.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ИзЗапроса"));
	ИзКонструктора = (Объект.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.Конструктором"));
	ИзДокумента = (Объект.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика"));
	Формулой = (Объект.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.Формула"));
	
	Элементы.ГруппаСКД.Видимость = ИзКонструктора;
	Элементы.ГруппаНастройкиДляЗапроса.Видимость = ИзЗапроса;
	Элементы.ГруппаВопросы.Видимость = ИзДокумента;
	Элементы.ГруппаФормула.Видимость = Формулой;

		
	Если ИзЗапроса Тогда
		Элементы.ВидИтоговЗаОдинПериод.Видимость = Не Объект.ЗапросОтображаетСостояние;			
	ИначеЕсли ИзКонструктора Тогда
		Элементы.ИА_СоответствиеАналитика1.Доступность = ЗначениеЗаполнено(Объект.ИА_Источник);
		Элементы.ИА_СоответствиеАналитика2.Доступность = ЗначениеЗаполнено(Объект.ИА_Источник);
		Элементы.ИА_СоответствиеАналитика3.Доступность = ЗначениеЗаполнено(Объект.ИА_Источник);
		Элементы.ИА_СоответствиеКоличество.Доступность = ЗначениеЗаполнено(Объект.ИА_Источник);
		
		Элементы.ИА_СоответствиеПериод.Доступность = ЗначениеЗаполнено(Объект.ИА_Источник);
		
		Если ЗначениеЗаполнено(Объект.ИА_Источник) И (Найти(Объект.ИА_Источник, ".СрезПоследних") <> 0
			Или Найти(Объект.ИА_Источник, ".СрезПервых") <> 0 Или Найти(Объект.ИА_Источник, ".Остатки") <> 0) Тогда
			Объект.ИА_СоответствиеПериод = "&ДатаКонца";
			Элементы.ИА_СоответствиеПериод.Доступность = Ложь;
		Иначе
			Элементы.ИА_СоответствиеПериод.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыЗапросаНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Хранилище = Об.ТабПараметровЗапроса;
	Знч = Хранилище.Получить();
	Если НЕ Знч = Неопределено Тогда
		ЗначениеВРеквизитФормы(Знч,"СписокПараметров");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если не ИА_Защита_Общий.ЛицензияДоступна("Статистика") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	ВосстановитьНастройки(ИА_КомпоновщикНастроек,ЭтаФорма.УникальныйИдентификатор);
	ПрочитатьПараметрыЗапросаНаСервере();
	
	//-> Григорьева
	ПериодПроверкиСтатистики.ДатаНачала = НачалоДня(ТекущаяДата() - 60*60*24*10);
	ПериодПроверкиСтатистики.ДатаОкончания = КонецДня(ТекущаяДата());
	//<- Григорьева
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиКомпоновщикаСервер()  
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.УстановитьНастройкиКомпоновщика(ИА_КомпоновщикНастроек);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИА_ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Структура = Новый Структура("ЭтоАналитика", Ложь);

	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.Форма.ИА_ФормаВыбораИсточника", Структура, ЭтаФорма,,,, Новый ОписаниеОповещения("ИА_ИсточникНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	  
КонецПроцедуры

&НаКлиенте
Процедура ИА_ИсточникНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Рез = Результат;
	
	СбросСоответствий();
	
	Если ЗначениеЗаполнено(Рез) Тогда 
		Объект.ИА_Источник = Рез.Имя;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(); 
	СбросНастроекОтборов();

КонецПроцедуры 

&НаКлиенте
Процедура СбросСоответствий()
	Объект.ИА_СоответствиеАналитика1 = Неопределено; 	
	Объект.ИА_СоответствиеАналитика2 = Неопределено; 	
	Объект.ИА_СоответствиеАналитика3 = Неопределено; 
	Объект.ИА_СоответствиеКоличество = Неопределено;
	Объект.ИА_СоответствиеПериод = Неопределено;
КонецПроцедуры
	

&НаКлиенте
Процедура ИА_СоответствиеАналитика1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(Элемент, ДанныеВыбора, СтандартнаяОбработка, 1);
КонецПроцедуры

&НаКлиенте
Процедура ИА_СоответствиеАналитика2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(Элемент, ДанныеВыбора, СтандартнаяОбработка, 2);
КонецПроцедуры

&НаКлиенте
Процедура ИА_СоответствиеАналитика3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораАналитики(Элемент, ДанныеВыбора, СтандартнаяОбработка, 3);
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитики(Элемент, ДанныеВыбора, СтандартнаяОбработка, НомерАналитики)

	СтандартнаяОбработка = Ложь;
	Структура = Новый Структура("ЭтоАналитика, Источник", Истина, Объект.ИА_Источник);
	Рез = Неопределено;

	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.Форма.ИА_ФормаВыбораИсточника", Структура, ЭтаФорма,,,, Новый ОписаниеОповещения("НачалоВыбораАналитикиЗавершение", ЭтотОбъект, Новый Структура("НомерАналитики", НомерАналитики)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАналитикиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НомерАналитики = ДополнительныеПараметры.НомерАналитики;
	
	
	Рез = Результат;
	
	Если ЗначениеЗаполнено(Рез) Тогда 
		Объект["ИА_СоответствиеАналитика" + НомерАналитики] = Рез.Имя;
	КонецЕсли;

КонецПроцедуры // НачалоВыбораАналитики()

&НаКлиенте
Процедура ИА_ИсточникОчистка(Элемент, СтандартнаяОбработка)
	 
	Объект.ИА_Источник = Неопределено;	 
	СбросСоответствий();                                         	
	УстановитьДоступностьЭлементов();
	СбросНастроекОтборов();   	
	
КонецПроцедуры 

&НаКлиенте
Процедура ИА_ИсточникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Текст = Объект.ИА_Источник Тогда
		Возврат;
	КонецЕсли;
	ПроверкаСодержимогоИсточника(Текст);
	  	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСодержимогоИсточника(Текст)

	Проверка = ПроверкаСервер(Текст);
	Если Проверка = Неопределено Тогда
		ПоказатьПредупреждение(,"Неверно выбран источник данных",, "Ошибка");
		Объект.ИА_Источник = Неопределено;
	КонецЕсли;	
	СбросСоответствий();
	УстановитьДоступностьЭлементов();
	СбросНастроекОтборов();

КонецПроцедуры // ПроверкаСодержимогоИсточника()

&НаСервереБезКонтекста
Функция ПроверкаСервер(Текст)

	Возврат Метаданные.НайтиПоПолномуИмени(Текст);

КонецФункции // ПроверкаСервер()

&НаСервере
Процедура СбросНастроекОтборов()
	
	УстановитьНастройкиКомпоновщика(ИА_КомпоновщикНастроек, ЭтаФорма.УникальныйИдентификатор);	

КонецПроцедуры // СбросНастроекОтборов()

&НаКлиенте
Процедура ИА_СоответствиеКоличествоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Структура = Новый Структура("ЭтоАналитика, Источник, ЭтоКоличество", Истина, Объект.ИА_Источник, истина);
	Рез = Неопределено;

	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.Форма.ИА_ФормаВыбораИсточника", Структура, ЭтаФорма,,,, Новый ОписаниеОповещения("ИА_СоответствиеКоличествоНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ИА_СоответствиеКоличествоНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Рез = Результат;
	
	Если ЗначениеЗаполнено(Рез) Тогда  
		Если Рез.Тип <> "Число" Тогда
			ПоказатьПредупреждение(,"Источником ресурсов должно быть поле типа <Число>",, "Ошибка");
			Объект.ИА_СоответствиеКоличество = Неопределено;
		Иначе
			Объект.ИА_СоответствиеКоличество = Рез.Имя;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИА_СоответствиеПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Структура = Новый Структура("ЭтоАналитика, Источник", Истина, Объект.ИА_Источник);
	Рез = Неопределено;

	ОткрытьФорму("Справочник.ИА_ВидыСтатистик.Форма.ИА_ФормаВыбораИсточника", Структура, ЭтаФорма,,,, Новый ОписаниеОповещения("ИА_СоответствиеПериодНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ИА_СоответствиеПериодНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Рез = Результат;
	
	Если ЗначениеЗаполнено(Рез) Тогда  
		Если Рез.Тип <> "Дата" Тогда 
			ПоказатьПредупреждение(,"Источником ресурсов должно быть поле типа <Дата>",, "Ошибка");
			Объект.ИА_СоответствиеПериод = Неопределено;
		Иначе
			Объект.ИА_СоответствиеПериод = Рез.Имя;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполнения(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ИА_Источник) Тогда
		Сообщить("Не заполнен <Источник данных>", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИА_СоответствиеКоличество) Тогда
		Сообщить("Не заполнено <Количество>", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;	                  
	
	Если Не ЗначениеЗаполнено(Объект.ИА_СоответствиеПериод) Тогда
		Сообщить("Не заполнен <Период>", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИА_ИсточникПриИзменении(Элемент)
	ПроверкаСодержимогоИсточника(Объект.ИА_Источник);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
    Запрос = Новый Запрос(Объект.ТекстЗапроса);	
	
	Попытка
		мПараметрыЗапроса = Запрос.НайтиПараметры();
    Исключение
        ИА_БФКС.СообщениеОбОшибке(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Для Каждого ПараметрЗапроса Из мПараметрыЗапроса Цикл
		
		//ИА_ 18.09.2015 Отсекаем предопределенные параметры
		Если ПараметрЗапроса.Имя = "ДатаНачала" ИЛИ ПараметрЗапроса.Имя = "ДатаКонца" Тогда 
			Продолжить;
		КонецЕсли;
		//
		
		ИмяПараметра =  ПараметрЗапроса.Имя;
		М = СписокПараметров.НайтиСтроки(Новый Структура("ИмяПараметра", ИмяПараметра));
        Если М.Количество() > 0 Тогда
            СтрокаПараметров = М[0];
        Иначе
        	СтрокаПараметров = СписокПараметров.Добавить();
            СтрокаПараметров.ИмяПараметра = ИмяПараметра;
        КонецЕсли; 
		СтрокаПараметров.Значение = ПараметрЗапроса.ТипЗначения.ПривестиЗначение(СтрокаПараметров.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
    ЗаполнитьПараметрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьКорректностьВидаСтатистики(Отказ = Неопределено, СоздаватьИсключение = Ложь)
    Если Объект.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ИзЗапроса
        И ПустаяСтрока(СокрЛП(Объект.ТекстЗапроса))
        Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не заполнен ""Текст запроса""";
        Сообщение.Сообщить(); 
    	Отказ = Истина;
        
        Если СоздаватьИсключение Тогда
        	ВызватьИсключение Сообщение.Текст; 
        КонецЕсли; 
	КонецЕсли;  
	
	Если Объект.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.Формула
        И ПустаяСтрока(СокрЛП(Объект.ФормулаРасчета))
        Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не заполнена ""Формула""";
        Сообщение.Сообщить(); 
    	Отказ = Истина;
        
        Если СоздаватьИсключение Тогда
        	ВызватьИсключение Сообщение.Текст; 
        КонецЕсли; 
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	тд = Элементы.СписокПараметров.ТекущиеДанные;
	Если тд.Значение = Неопределено Тогда
		Элемент.ВыбиратьТип = Истина;
	Иначе
		Элемент.ВыбиратьТип = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПараметровЗначениеОчистка(Элемент, СтандартнаяОбработка)
	Элемент.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровПараметрПриИзменении(Элемент)
	тд = Элементы.СписокПараметров.ТекущиеДанные;
	Если ЛЕВ(ВРЕГ(тд.ИмяПараметра),8) = "ПАРАМЕТР" Тогда
		тд.ИмяПараметра = "неопределено";
		Сообщить("Переметры нельзя называть в виде ""Параметр...""");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиXML()
	
	об = РеквизитФормыВЗначение("Объект");
	Настройки = об.ИА_НастройкаОтбораХранилище.Получить();
	Возврат Настройки;
	
КонецФункции

&НаСервере
Процедура УстановитьНастройкиКомпоновщика(ИА_КомпоновщикНастроек, уид) 
		
	СКД = Справочники.ИА_ВидыСтатистик.ПолучитьМакет("МакетСКД");
	Если ЗначениеЗаполнено(Объект.ИА_Источник) Тогда
		СКД.НаборыДанных.НаборДанных1.Запрос = "ВЫБРАТЬ * ИЗ " + Объект.ИА_Источник;
	Иначе
		Возврат;
	КонецЕсли;

	АдресСКД = ПоместитьВоВременноеХранилище(СКД,уид);
	ИА_КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД)); //отвечает за доступность полей выбора
	ИА_КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		   	
КонецПроцедуры 

&НаСервере
Процедура ВосстановитьНастройки(ИА_КомпоновщикНастроек, уид) 
	
	об = РеквизитФормыВЗначение("Объект");
	УстановитьНастройкиКомпоновщика(ИА_КомпоновщикНастроек, уид);
	Если об.ИА_НастройкаОтбораХранилище.Получить()<>Неопределено Тогда
		ИА_КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьНастройкиXML());
	КонецЕсли; 
		
КонецПроцедуры



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//
	ПроверитьКорректностьВидаСтатистики(Отказ);
	
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(Справочники.ИА_ВидыСтатистик.ПолучитьСсылку(Новый УникальныйИдентификатор));
	КонецЕсли;
	
	// 
	Если Объект.ВариантПолученияДанных <> Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ИзЗапроса Тогда 
		Объект.ВидИтоговЗаОдинПериод = Перечисления.ИА_ВидыИтоговЗаОдинПериод.Сумма;
	КонецЕсли;
	
	// сохраним отборы в конструкторе
	ТекущийОбъект.ИА_НастройкаОтбораХранилище = Новый ХранилищеЗначения(ИА_КомпоновщикНастроек.Настройки);
	
	//
	Запрос = ПолучитьЗапросСтатистики(ТекущийОбъект);
	ТекущийОбъект.ТекстЗапросаИтоговый = Запрос.Текст;
	//		
	тзПараметры = Новый ТаблицаЗначений;
	тзПараметры.Колонки.Добавить("ИмяПараметра");
	тзПараметры.Колонки.Добавить("Значение");
	Для каждого Параметр из Запрос.Параметры Цикл
		стр = тзПараметры.Добавить();
		стр.ИмяПараметра = Параметр.Ключ;
		стр.Значение = Параметр.Значение;
	КонецЦикла;
	Хранилище = Новый ХранилищеЗначения(тзПараметры);
	ТекущийОбъект.ТабПараметровЗапроса = Хранилище;
	//
	
	//Формула
	Если ТекущийОбъект.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.Формула Тогда 
		ТекущийОбъект.СтатистикиФормулы.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ВидыСтатистик.Ссылка КАК Статистика,
		               |	ИА_ВидыСтатистик.КраткоеНаименование КАК КраткоеНаименование
		               |ИЗ
		               |	Справочник.ИА_ВидыСтатистик КАК ИА_ВидыСтатистик
		               |ГДЕ
		               |	ИА_ВидыСтатистик.КраткоеНаименование <> """"";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если найти(ТекущийОбъект.ФормулаРасчета,  "["+Выборка.КраткоеНаименование+"]") > 0 Тогда
				Новстр = ТекущийОбъект.СтатистикиФормулы.Добавить();
				Новстр.Статистика = Выборка.Статистика;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатистику(Команда)
	
	//-> Григорьева
	Если Не ЗначениеЗаполнено(ПериодПроверкиСтатистики.ДатаНачала)
		ИЛИ НЕ ЗначениеЗаполнено(ПериодПроверкиСтатистики.ДатаОкончания)
		ИЛИ ПериодПроверкиСтатистики.ДатаНачала > ПериодПроверкиСтатистики.ДатаОкончания
		Тогда
			ИА_КСУОбщийКлиентСервер.СообщитьПользователю("Некорректно задан период",, "ПериодПроверкиСтатистики");
			Возврат;
	КонецЕсли; 
	//<- Григорьева
	
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьСтатистикуЗавершение", ЭтотОбъект), "Для проверки необходимо записать изменения. Продолжить?",РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ПроверитьСтатистикуФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатистикуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Записать();
	Иначе
		возврат;
	КонецЕсли;
	
	ПроверитьСтатистикуФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатистикуФрагмент()
	
	Перем ТабДок;
	
	ТабДок = ПечатьСтатистики_Сервер();
	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Функция ПечатьСтатистики_Сервер()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Справочники.ИА_ВидыСтатистик.ПолучитьМакет("ПроверкаСтатистики");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОблШапка);
	
	Если Объект.ВариантПолученияДанных=Перечисления.ИА_ВариантыПолученияДанныхСтатистик.Формула Тогда
		РезТЗ_Данные = Новый ТаблицаЗначений;
		РезТЗ_Данные.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
		РезТЗ_Данные.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
		РезТЗ_Данные.Колонки.Добавить("ДатаКонца", Новый ОписаниеТипов("Дата"));
		РезТЗ_Данные.Колонки.Добавить("Аналитика1", Новый ОписаниеТипов(Объект.Аналитика1.ТипАналитикиПолный));
		РезТЗ_Данные.Колонки.Добавить("Аналитика2", Новый ОписаниеТипов(Объект.Аналитика2.ТипАналитикиПолный));
		РезТЗ_Данные.Колонки.Добавить("Аналитика3", Новый ОписаниеТипов(Объект.Аналитика3.ТипАналитикиПолный));		
		РезТЗ_Данные.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число"));
		
		РезТЗ_Данные.Колонки.Добавить("РеальныеДанные", Новый ОписаниеТипов("Булево"));
		РезТЗ_Данные.Колонки.Добавить("ЕстьЗначение", Новый ОписаниеТипов("Булево"));
		РезТЗ_Данные.Колонки.Добавить("ДанныеВведены", Новый ОписаниеТипов("Булево"));
		
		СтруктСтрСтат = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные,ПериодДетализации", объект.Ссылка,Неопределено,Неопределено,Неопределено,РезТЗ_Данные, Перечисления.ИА_ПериодыДетализации.День);
		
		ИА_Статистики.ПолучитьТаблицуПериодов(ПериодПроверкиСтатистики.ДатаНачала, ПериодПроверкиСтатистики.ДатаОкончания,СтруктСтрСтат,Неопределено);		
		тз = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтруктСтрСтат,ПериодПроверкиСтатистики.ДатаНачала, ПериодПроверкиСтатистики.ДатаОкончания);
		
		Для каждого стр из тз Цикл
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
			ОблСтрока.Параметры.Заполнить(стр);
			ТабДок.Вывести(ОблСтрока);
		КонецЦикла;
	Иначе
		об = РеквизитФормыВЗначение("Объект");
		об.ИА_НастройкаОтбораХранилище = Новый ХранилищеЗначения(ИА_КомпоновщикНастроек.Настройки);
		Запрос = ПолучитьЗапросСтатистики(об);
		
		Запрос.УстановитьПараметр("ДатаНачала", ПериодПроверкиСтатистики.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКонца", ПериодПроверкиСтатистики.ДатаОкончания);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		Запрос.УстановитьПараметр("Аналитика1", Неопределено);
		Запрос.УстановитьПараметр("Аналитика2", Неопределено);
		Запрос.УстановитьПараметр("Аналитика3", Неопределено);
		
		Выборка = Запрос.выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
			ОблСтрока.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОблСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;
КонецФункции

&НаСервере
Функция ПолучитьЗапросСтатистики(пОбъект)
	табПарам = РеквизитФормыВЗначение("СписокПараметров");
	возврат пОбъект.ПолучитьЗапросСтатистики(табПарам);
КонецФункции

&НаКлиенте
Процедура СписокПараметровПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Если Объект.Ссылка.Пустая() Тогда Возврат; КонецЕсли; 
	Отказ = Истина; Если Объект.ПроверочныйСписок.Пустая() Тогда Возврат; КонецЕсли;
	Параметр = Новый Структура; Параметр.Очистить();
	Параметр.Вставить("Владелец" , Объект.ПроверочныйСписок);
	ОткрытьФорму("Справочник.ИА_ВопросыПроверочногоСписка.Форма.ФормаЭлемента", Параметр, Объект.ПроверочныйСписок,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Процедура ПередНачаломДобавленияНаСервере(Параметр)
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ВопросыОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВопросыОбработкаЗаписиНовогоНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеЗапросОтображаетСостояниеПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьВеб = КСУ_ВебПИ.ЕстьИнтеграцияВеб();
	
	Элементы.ВебУИД.Видимость =  ЕстьВеб;
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	Если Объект.Ссылка.Пустая() ТОгда
		Объект.ВариантПолученияДанных=Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатистикуВФормулу(Команда)
	ВыбСтат = ПредопределенноеЗначение("Справочник.ИА_ВидыСтатистик.ПустаяСсылка");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ДобавитьСтатистикуВФормулуЗавершение", ЭтотОбъект), ВыбСтат);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатистикуВФормулуЗавершение(Значение, ДополнительныеПараметры) Экспорт
		
	Если (Значение <> Неопределено) Тогда
		ТекстДобавляния = ПолучитьКраткоеНаим(Значение);
		Элементы.ФормулаРасчета.ВыделенныйТекст = "[" + ТекстДобавляния + "]";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКраткоеНаим(видСт)
	возврат видст.КраткоеНаименование;
КонецФункции
